import { Period } from './definitions';

export const periodsData: Period[] = [
	{
		label: 'Наука',
		years: [2010, 2019],
		items: [
			{ year: 2010, text: 'Открытие новой планеты в Солнечной системе' },
			{ year: 2012, text: 'Открытие Бозона Хиггса' },
			{ year: 2014, text: 'Исследования космоса с помощью космического телескопа' },
			{ year: 2016, text: 'Открытие потенциальных следов жизни на Марсе' },
			{ year: 2018, text: 'Разработка квантового компьютера' },
		],
	},
	{
		label: 'Спорт',
		years: [2008, 2016],
		items: [
			{ year: 2008, text: 'Олимпийские игры в Пекине' },
			{ year: 2010, text: 'Чемпионат мира по футболу в ЮАР' },
			{ year: 2012, text: 'Олимпийские игры в Лондоне' },
			{ year: 2014, text: 'Олимпийские зимние игры в Сочи' },
			{ year: 2016, text: 'Олимпийские игры в Рио-де-Жанейро' },
		],
	},
	{
		label: 'Музыка',
		years: [2005, 2013],
		items: [
			{ year: 2005, text: 'Выход альбома "X&Y" группы Coldplay' },
			{ year: 2007, text: 'Выход альбома "Грядущий" группы Мельница' },
			{ year: 2011, text: 'Выход альбома "21" Адель' },
			{ year: 2013, text: 'Выход альбома "Random Access Memories" группы Daft Punk' },
		],
	},
	{
		label: 'Искусство',
		years: [2003, 2012],
		items: [
			{ year: 2003, text: 'Выставка Пикассо в Музее Искусств Современности' },
			{ year: 2005, text: 'Премьера фильма "Авиатор" о Ховарде Хьюзе' },
			{ year: 2012, text: 'Открытие Гуггенхайм-Абу-Даби' },
		],
	},
	{
		label: 'Мода',
		years: [2011, 2019],
		items: [
			{ year: 2011, text: 'Показ коллекции Марка Джейкобса' },
			{ year: 2013, text: 'Премьера фильма "Дьявол носит Прада 2"' },
			{ year: 2014, text: 'Выход первой коллекции "Gucci" под руководством Алессандро Микеле' },
			{ year: 2019, text: 'Сотрудничество "Louis Vuitton" с художником Джеффом Кунсом' },
		],
	},

	{
		label: 'Медицина',
		years: [2006, 2014],
		items: [
			{ year: 2006, text: 'Разработка вакцины от гепатита С' },
			{ year: 2008, text: 'Открытие нового метода лечения рака' },
			{ year: 2010, text: 'Выход первого препарата для лечения аллергии' },
			{ year: 2012, text: 'Открытие генетической терапии для гемофилии' },
			{ year: 2014, text: 'Разработка искусственного сердца' },
		],
	},
];
